#### [데이터 필터링]
- Series/DataFrame에서 조건에 맞는 원하는 데이터 추출
- 방법
    * Boolean Indexing Series
    * isin() / query()
- 필터링 연산자
    * 비교연산자: >, >=, <, >=, ==, !=
    * 논리연산자: &(and), |(or), ~(not)

[1] 모듈 로딩 및 데이터 준비 <hr>

In [1]:
import pandas as pd

In [13]:
# 데이터 준비
data = [[10, 13, 41],
        [21, 9, 7], 
        [19, 78, 33],
        [30, 26, 19],
        [94, 38, 52]]

columns = ['A', 'B', 'C']

dataDF = pd.DataFrame(data, columns=columns)
display(dataDF)

    A   B   C
0  10  13  41
1  21   9   7
2  19  78  33
3  30  26  19
4  94  38  52

[2] 불린 인덱싱(Boolean Indexing) <hr>

In [16]:
# [조건] A컬럼에서 데이터가 20 이상인 데이터들만 선택/추출
# - DF[컬럼명]: 컬럼 선택
retSR = dataDF['A'] >= 20
display(retSR)

# - 전체 DF에서 A컬럼 데이터가 20 이상인 데이터만 선택
sr1 = dataDF[retSR]
sr2 = dataDF[dataDF['A'] >= 20]
display(sr1, sr2)

0    False
1     True
2    False
3     True
4     True
Name: A, dtype: bool

    A   B   C
1  21   9   7
3  30  26  19
4  94  38  52

    A   B   C
1  21   9   7
3  30  26  19
4  94  38  52

In [ ]:
# 데이터 준비
data = {'이름':['홍길동', '마징가', '홍이장군', '배트맨'], 
        '나이':['20', '10', '42', '38'],
        '성별':['남', '남', '여', '남']}

dataDF = pd.DataFrame(data)

display(dataDF)

     이름  나이 성별
0   홍길동  20  남
1   마징가  10  남
2  홍이장군  42  여
3   배트맨  38  남

In [30]:
# [조건] 성별이 남자인 데이터만 추출
bool_idx = dataDF['성별'] == '남'
# bool_idx = dataDF.성별 == '남'

display(bool_idx)

ret_data1 = dataDF[bool_idx]
ret_data2 = dataDF[dataDF['성별'] == '남']

display(ret_data1)

0     True
1     True
2    False
3     True
Name: 성별, dtype: bool

    이름  나이 성별
0  홍길동  20  남
1  마징가  10  남
3  배트맨  38  남

In [42]:
# [조건] 나이가 20세 이상인 데이터만 선택/추출
bool_idx = dataDF['나이'] >= '20'
# bool_idx = dataDF.나이 >= '20'

ret_data1 = dataDF[bool_idx]
ret_data2 = dataDF[dataDF['나이'] >= '20']

display(ret_data1)

     이름  나이 성별
0   홍길동  20  남
2  홍이장군  42  여
3   배트맨  38  남

In [51]:
# [조건] 나이가 20세 이상이고 성별이 남자인 데이터 선택
mask = (dataDF.나이 >= '20') & (dataDF.성별 == '남')  

dataDF1 = dataDF[mask]

dataDF2 = dataDF[(dataDF.나이 >= '20') & (dataDF.성별 == '남')]

display(dataDF1, dataDF2)

    이름  나이 성별
0  홍길동  20  남
3  배트맨  38  남

    이름  나이 성별
0  홍길동  20  남
3  배트맨  38  남